In [43]:
import datetime as dt
import numpy as np
import pandas as pd

In [44]:
pd.__version__

'2.2.1'

# Creating a DataFrame object

Creating a DataFrame object from a Series object

In [48]:
np.random.seed(0) # set a seed for reproducibility
# index를 manual하게 넣어줌. 안 넣었으면 자동으로 0,1,2,3,4
s = pd.Series(np.random.rand(5), index = ["a","b","c","d","e"],name="Column_name")
# google colab에서 column명은 0으로 들어간다.
s

a    0.548814
b    0.715189
c    0.602763
d    0.544883
e    0.423655
Name: Column_name, dtype: float64

In [49]:
s.to_frame()

   Column_name
a     0.548814
b     0.715189
c     0.602763
d     0.544883
e     0.423655

In [51]:
pd.Series(np.linspace(0,10,num=5))

0     0.0
1     2.5
2     5.0
3     7.5
4    10.0
dtype: float64

In [53]:
pd.Series(np.linspace(0,10,num=5)).to_frame()

      0
0   0.0
1   2.5
2   5.0
3   7.5
4  10.0

Creating a DataFrame from Dict

In [54]:
data = {'apples':[3,2,0,1], 'orange':[0,3,7,2]}
type(data)

dict

In [55]:
df = pd.DataFrame(data)
df

   apples  orange
0       3       0
1       2       3
2       0       7
3       1       2

In [56]:
df.index = ['Ace', 'Baloon', 'Coco', 'Data']
df

        apples  orange
Ace          3       0
Baloon       2       3
Coco         0       7
Data         1       2

In [57]:
df2 = pd.DataFrame(data, index =['Ace', 'Baloon', 'Coco', 'Data'])
df2

        apples  orange
Ace          3       0
Baloon       2       3
Coco         0       7
Data         1       2

In [58]:
pd.DataFrame(
    {
        'random':np.random.rand(5),
        'text':['hot','warm','cool','cold',None],
        'truth':[np.random.choice([True,False]) for _ in range(5)]
    },
    index= pd.date_range(
        end=dt.date(2019, 4, 21),
        freq='1D',
        periods=5,
        name='date'
    )
)

              random  text  truth
date
2019-04-17  0.645894   hot   True
2019-04-18  0.437587  warm  False
2019-04-19  0.891773  cool  False
2019-04-20  0.963663  cold   True
2019-04-21  0.383442  None   True

from_dict() method

In [59]:
data = {'col_1': [3, 2, 1, 0], 'col_2': ['a', 'b', 'c', 'd']}
data

{'col_1': [3, 2, 1, 0], 'col_2': ['a', 'b', 'c', 'd']}

In [60]:
pd.DataFrame.from_dict(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [62]:
pd.DataFrame.from_dict(data, orient='index') # 전치된 행렬이 나온다.

       0  1  2  3
col_1  3  2  1  0
col_2  a  b  c  d

In [63]:
df3 = pd.DataFrame.from_dict(data, orient='index')
df3.index = ['row1','row2']
df3

      0  1  2  3
row1  3  2  1  0
row2  a  b  c  d

In [64]:
df4 = pd.DataFrame.from_dict(data, orient='index', columns = ['A','B','C','D'])
df4

       A  B  C  D
col_1  3  2  1  0
col_2  a  b  c  d

In [65]:
pd.DataFrame([
    {'mag':5.2, 'place':'California'},
    {'mag':1.2, 'place':'Alaska'},
    {'mag':0.2, 'place':'California'}
])

   mag       place
0  5.2  California
1  1.2      Alaska
2  0.2  California

In [66]:
list_of_tuples = [(n, n**2, n**3) for n in range(5)]
list_of_tuples

[(0, 0, 0), (1, 1, 1), (2, 4, 8), (3, 9, 27), (4, 16, 64)]

In [74]:
df1 = pd.DataFrame(
    list_of_tuples,
    #columns = ['n', 'n_squared', 'n_cubed'],
)
df1

   0   1   2
0  0   0   0
1  1   1   1
2  2   4   8
3  3   9  27
4  4  16  64

In [75]:
df1.columns =['n','n^2','n^2']
df1

   n  n^2  n^2
0  0    0    0
1  1    1    1
2  2    4    8
3  3    9   27
4  4   16   64

# Reading data from a CSV file

In [ ]:
#from google.colab import files
#file_uploaded = files.upload()

In [80]:
df = pd.read_csv('dataset.csv')
df

        apples   oranges
Ace          3         0
Baloon       2         3
Coco         0         7
Data         1         2

In [81]:
df = pd.read_csv('dataset.csv', index_col=0)
df

        apples   oranges
Ace          3         0
Baloon       2         3
Coco         0         7
Data         1         2

In [87]:
df.to_csv('./output.csv', index=False)

Drag and Drop

In [98]:
movies_df = pd.read_csv("./IMDB-Movie-Data.csv", index_col="Title") # Movie Ranking from 2006 to 2016
movies_df

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...
Secret in Their Eyes,996,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
Hostel: Part II,997,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
Step Up 2: The Streets,998,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
Search Party,999,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [112]:
movies_df.head()

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [113]:
movies_df.head(10)

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
5,6,The Great Wall,"Action,Adventure,Fantasy",European mercenaries searching for black powde...,Yimou Zhang,"Matt Damon, Tian Jing, Willem Dafoe, Andy Lau",2016,103,6.1,56036,45.13,42.0
6,7,La La Land,"Comedy,Drama,Music",A jazz pianist falls for an aspiring actress i...,Damien Chazelle,"Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....",2016,128,8.3,258682,151.06,93.0
7,8,Mindhorn,Comedy,A has-been actor best known for playing the ti...,Sean Foley,"Essie Davis, Andrea Riseborough, Julian Barrat...",2016,89,6.4,2490,NaN,71.0
8,9,The Lost City of Z,"Action,Adventure,Biography","A true-life drama, centering on British explor...",James Gray,"Charlie Hunnam, Robert Pattinson, Sienna Mille...",2016,141,7.1,7188,8.01,78.0
9,10,Passengers,"Adventure,Drama,Romance",A spacecraft traveling to a distant colony pla...,Morten Tyldum,"Jennifer Lawrence, Chris Pratt, Michael Sheen,...",2016,116,7.0,192177,100.01,41.0

In [114]:
movies_df.tail() # NaN : Not a Number

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
995,996,Secret in Their Eyes,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
996,997,Hostel: Part II,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
997,998,Step Up 2: The Streets,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
998,999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
999,1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [115]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  872 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

In [116]:
movies_df.describe() # object 제외 columns들 분석

,Rank,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
count,1000.000000,1000.000000,1000.000000,1000.000000,1.000000e+03,872.000000,936.000000
mean,500.500000,2012.783000,113.172000,6.723200,1.698083e+05,82.956376,58.985043
std,288.819436,3.205962,18.810908,0.945429,1.887626e+05,103.253540,17.194757
min,1.000000,2006.000000,66.000000,1.900000,6.100000e+01,0.000000,11.000000
25%,250.750000,2010.000000,100.000000,6.200000,3.630900e+04,13.270000,47.000000
50%,500.500000,2014.000000,111.000000,6.800000,1.107990e+05,47.985000,59.500000
75%,750.250000,2016.000000,123.000000,7.400000,2.399098e+05,113.715000,72.000000
max,1000.000000,2016.000000,191.000000,9.000000,1.791916e+06,936.630000,100.000000

In [117]:
movies_df.astype('object').describe() # 수치형 카테고리컬 데이터의 분석

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
count,1000,1000,1000,1000,1000,1000,1000,1000,1000.0,1000,872.00,936.0
unique,1000,999,207,1000,644,996,11,94,55.0,997,814.00,84.0
top,1,The Host,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,Ridley Scott,"Jennifer Lawrence, Josh Hutcherson, Liam Hemsw...",2016,108,7.1,97141,0.03,72.0
freq,1,2,50,1,8,2,297,31,52.0,2,7.00,25.0

In [118]:
movies_df = pd.read_csv("IMDB-Movie-Data.csv")
movies_df

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Secret in Their Eyes,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
996,997,Hostel: Part II,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
997,998,Step Up 2: The Streets,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
998,999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
999,1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [119]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  872 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

In [120]:
movies_df.shape

(1000, 12)

In [125]:
# temp_df = movies_df.append(movies_df) # in Version 2 append is deleted, using concat
temp_df = pd.concat([movies_df,movies_df])
temp_df.shape

(2000, 12)

In [126]:
temp_df = temp_df.drop_duplicates()
temp_df.shape

(1000, 12)

In [127]:
movies_df.describe()

,Rank,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
count,1000.000000,1000.000000,1000.000000,1000.000000,1.000000e+03,872.000000,936.000000
mean,500.500000,2012.783000,113.172000,6.723200,1.698083e+05,82.956376,58.985043
std,288.819436,3.205962,18.810908,0.945429,1.887626e+05,103.253540,17.194757
min,1.000000,2006.000000,66.000000,1.900000,6.100000e+01,0.000000,11.000000
25%,250.750000,2010.000000,100.000000,6.200000,3.630900e+04,13.270000,47.000000
50%,500.500000,2014.000000,111.000000,6.800000,1.107990e+05,47.985000,59.500000
75%,750.250000,2016.000000,123.000000,7.400000,2.399098e+05,113.715000,72.000000
max,1000.000000,2016.000000,191.000000,9.000000,1.791916e+06,936.630000,100.000000

In [132]:
movies_df['Genre'].describe()

count                        1000
unique                        207
top       Action,Adventure,Sci-Fi
freq                           50
Name: Genre, dtype: object

In [133]:
movies_df.astype('object').describe()

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
count,1000,1000,1000,1000,1000,1000,1000,1000,1000.0,1000,872.00,936.0
unique,1000,999,207,1000,644,996,11,94,55.0,997,814.00,84.0
top,1,The Host,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,Ridley Scott,"Jennifer Lawrence, Josh Hutcherson, Liam Hemsw...",2016,108,7.1,97141,0.03,72.0
freq,1,2,50,1,8,2,297,31,52.0,2,7.00,25.0

# Tables

In [134]:
from datascience import *

In [135]:
movie_t = Table.read_table('IMDB-Movie-Data.csv')
movie_t

Rank | Title                   | Genre                      | Description                                                  | Director             | Actors                                                       | Year | Runtime (Minutes) | Rating | Votes  | Revenue (Millions) | Metascore
1    | Guardians of the Galaxy | Action,Adventure,Sci-Fi    | A group of intergalactic criminals are forced to work to ... | James Gunn           | Chris Pratt, Vin Diesel, Bradley Cooper, Zoe Saldana         | 2014 | 121               | 8.1    | 757074 | 333.13             | 76
2    | Prometheus              | Adventure,Mystery,Sci-Fi   | Following clues to the origin of mankind, a team finds a ... | Ridley Scott         | Noomi Rapace, Logan Marshall-Green, Michael Fassbender,  ... | 2012 | 124               | 7      | 485820 | 126.46             | 65
3    | Split                   | Horror,Thriller            | Three girls are kidnapped by a man with a diagnosed 23 d ... | M. Night Shyamalan   | James McAvoy, Anya Taylor-Joy, Haley Lu Richardson, Jess ... | 2016 | 117               | 7.3    | 157606 | 138.12             | 62
4    | Sing                    | Animation,Comedy,Family    | In a city of humanoid animals, a hustling theater impres ... | Christophe Lourdelet | Matthew McConaughey,Reese Witherspoon, Seth MacFarlane,  ... | 2016 | 108               | 7.2    | 60545  | 270.32             | 59
5    | Suicide Squad           | Action,Adventure,Fantasy   | A secret government agency recruits some of the most dan ... | David Ayer           | Will Smith, Jared Leto, Margot Robbie, Viola Davis           | 2016 | 123               | 6.2    | 393727 | 325.02             | 40
6    | The Great Wall          | Action,Adventure,Fantasy   | European mercenaries searching for black powder become e ... | Yimou Zhang          | Matt Damon, Tian Jing, Willem Dafoe, Andy Lau                | 2016 | 103               | 6.1    | 56036  | 45.13              | 42
7    | La La Land              | Comedy,Drama,Music         | A jazz pianist falls for an aspiring actress in Los Angeles. | Damien Chazelle      | Ryan Gosling, Emma Stone, Rosemarie DeWitt, J.K. Simmons     | 2016 | 128               | 8.3    | 258682 | 151.06             | 93
8    | Mindhorn                | Comedy                     | A has-been actor best known for playing the title charac ... | Sean Foley           | Essie Davis, Andrea Riseborough, Julian Barratt,Kenneth  ... | 2016 | 89                | 6.4    | 2490   | nan                | 71
9    | The Lost City of Z      | Action,Adventure,Biography | A true-life drama, centering on British explorer Col. Pe ... | James Gray           | Charlie Hunnam, Robert Pattinson, Sienna Miller, Tom Holland | 2016 | 141               | 7.1    | 7188   | 8.01               | 78
10   | Passengers              | Adventure,Drama,Romance    | A spacecraft traveling to a distant colony planet and tr ... | Morten Tyldum        | Jennifer Lawrence, Chris Pratt, Michael Sheen,Laurence F ... | 2016 | 116               | 7      | 192177 | 100.01             | 41
... (990 rows omitted)

In [136]:
type(movie_t)

datascience.tables.Table

drag and drop "cones.csv", "nba_salaries.csv"

In [137]:
cones = Table.read_table('cones.csv')
cones

Flavor     | Color       | Price | Rating
strawberry | pink        | 3.55  | 1
chocolate  | light brown | 4.75  | 4
chocolate  | dark brown  | 5.25  | 3
strawberry | pink        | 5.25  | 2
chocolate  | dark brown  | 5.25  | 5
bubblegum  | pink        | 4.75  | 1

In [138]:
# Define cones' attributes
conesAttributes = ["Flavor", "Color", "Price"]
# Define cones' data, must be same sequence as attributes
conesData = [
    ["strawberry", "pink", 3.55],
    ["chocolate", "light brown", 4.75],
    ["chocolate", "dark brown", 5.25],
    ["strawberry", "pink", 5.25],
    ["chocolate", "dark brown", 5.25],
    ["bubblegem", "pink", 4.75]
]

In [139]:
df = pd.DataFrame(data=conesData, columns=conesAttributes)
df

       Flavor        Color  Price
0  strawberry         pink   3.55
1   chocolate  light brown   4.75
2   chocolate   dark brown   5.25
3  strawberry         pink   5.25
4   chocolate   dark brown   5.25
5   bubblegem         pink   4.75

In [140]:
cones_tbl = Table().from_df(df)
cones_tbl

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegem  | pink        | 4.75

In [141]:
cones.show(3)

In [142]:
cones.show()

In [143]:
cones.select('Flavor')

Flavor
strawberry
chocolate
chocolate
strawberry
chocolate
bubblegum

In [144]:
cones.select('Flavor', 'Price')

Flavor     | Price
strawberry | 3.55
chocolate  | 4.75
chocolate  | 5.25
strawberry | 5.25
chocolate  | 5.25
bubblegum  | 4.75

In [145]:
cones.drop('Price')

Flavor     | Color       | Rating
strawberry | pink        | 1
chocolate  | light brown | 4
chocolate  | dark brown  | 3
strawberry | pink        | 2
chocolate  | dark brown  | 5
bubblegum  | pink        | 1

In [146]:
cones

Flavor     | Color       | Price | Rating
strawberry | pink        | 3.55  | 1
chocolate  | light brown | 4.75  | 4
chocolate  | dark brown  | 5.25  | 3
strawberry | pink        | 5.25  | 2
chocolate  | dark brown  | 5.25  | 5
bubblegum  | pink        | 4.75  | 1

In [165]:
cones_without_price = cones.drop('Price')
cones_without_price

Flavor     | Color       | Rating
strawberry | pink        | 1
chocolate  | light brown | 4
chocolate  | dark brown  | 3
strawberry | pink        | 2
chocolate  | dark brown  | 5
bubblegum  | pink        | 1

In [148]:
cones.where('Flavor', 'chocolate')

Flavor    | Color       | Price | Rating
chocolate | light brown | 4.75  | 4
chocolate | dark brown  | 5.25  | 3
chocolate | dark brown  | 5.25  | 5

In [149]:
cones.sort('Price')

Flavor     | Color       | Price | Rating
strawberry | pink        | 3.55  | 1
chocolate  | light brown | 4.75  | 4
bubblegum  | pink        | 4.75  | 1
chocolate  | dark brown  | 5.25  | 3
strawberry | pink        | 5.25  | 2
chocolate  | dark brown  | 5.25  | 5

In [150]:
cones.sort('Price', descending=True)

Flavor     | Color       | Price | Rating
chocolate  | dark brown  | 5.25  | 3
strawberry | pink        | 5.25  | 2
chocolate  | dark brown  | 5.25  | 5
chocolate  | light brown | 4.75  | 4
bubblegum  | pink        | 4.75  | 1
strawberry | pink        | 3.55  | 1

In [151]:
cones.sort('Flavor', descending=True)

Flavor     | Color       | Price | Rating
strawberry | pink        | 3.55  | 1
strawberry | pink        | 5.25  | 2
chocolate  | light brown | 4.75  | 4
chocolate  | dark brown  | 5.25  | 3
chocolate  | dark brown  | 5.25  | 5
bubblegum  | pink        | 4.75  | 1

In [152]:
type(cones)

datascience.tables.Table

In [153]:
cones_df = cones.to_df()
cones_df

       Flavor        Color  Price  Rating
0  strawberry         pink   3.55       1
1   chocolate  light brown   4.75       4
2   chocolate   dark brown   5.25       3
3  strawberry         pink   5.25       2
4   chocolate   dark brown   5.25       5
5   bubblegum         pink   4.75       1

In [154]:
cones_df.drop(columns='Color')

       Flavor  Price  Rating
0  strawberry   3.55       1
1   chocolate   4.75       4
2   chocolate   5.25       3
3  strawberry   5.25       2
4   chocolate   5.25       5
5   bubblegum   4.75       1

In [155]:
cones_df.drop(labels='Price',axis=1)

       Flavor        Color  Rating
0  strawberry         pink       1
1   chocolate  light brown       4
2   chocolate   dark brown       3
3  strawberry         pink       2
4   chocolate   dark brown       5
5   bubblegum         pink       1

In [156]:
cones_df.drop(labels=2,axis=0)

       Flavor        Color  Price  Rating
0  strawberry         pink   3.55       1
1   chocolate  light brown   4.75       4
3  strawberry         pink   5.25       2
4   chocolate   dark brown   5.25       5
5   bubblegum         pink   4.75       1

In [157]:
cones.sort('Price')

Flavor     | Color       | Price | Rating
strawberry | pink        | 3.55  | 1
chocolate  | light brown | 4.75  | 4
bubblegum  | pink        | 4.75  | 1
chocolate  | dark brown  | 5.25  | 3
strawberry | pink        | 5.25  | 2
chocolate  | dark brown  | 5.25  | 5

In [158]:
cones.sort('Price', descending=True)

Flavor     | Color       | Price | Rating
chocolate  | dark brown  | 5.25  | 3
strawberry | pink        | 5.25  | 2
chocolate  | dark brown  | 5.25  | 5
chocolate  | light brown | 4.75  | 4
bubblegum  | pink        | 4.75  | 1
strawberry | pink        | 3.55  | 1

In [159]:
cones_df.sort_values(by=['Price'])

       Flavor        Color  Price  Rating
0  strawberry         pink   3.55       1
1   chocolate  light brown   4.75       4
5   bubblegum         pink   4.75       1
2   chocolate   dark brown   5.25       3
3  strawberry         pink   5.25       2
4   chocolate   dark brown   5.25       5

In [160]:
cones_df.sort_values(by=['Price'], ascending=False)

       Flavor        Color  Price  Rating
2   chocolate   dark brown   5.25       3
3  strawberry         pink   5.25       2
4   chocolate   dark brown   5.25       5
1   chocolate  light brown   4.75       4
5   bubblegum         pink   4.75       1
0  strawberry         pink   3.55       1

In [161]:
cones.where('Flavor', 'chocolate')

Flavor    | Color       | Price | Rating
chocolate | light brown | 4.75  | 4
chocolate | dark brown  | 5.25  | 3
chocolate | dark brown  | 5.25  | 5

In [162]:
filter = cones_df['Flavor'] == 'chocolate'
cones_df.loc[filter]

      Flavor        Color  Price  Rating
1  chocolate  light brown   4.75       4
2  chocolate   dark brown   5.25       3
4  chocolate   dark brown   5.25       5

In [163]:
cones_df.where(cones_df['Flavor']=='chocolate')

      Flavor        Color  Price  Rating
0        NaN          NaN    NaN     NaN
1  chocolate  light brown   4.75     4.0
2  chocolate   dark brown   5.25     3.0
3        NaN          NaN    NaN     NaN
4  chocolate   dark brown   5.25     5.0
5        NaN          NaN    NaN     NaN

In [164]:
cones.column(2).mean()

4.7999999999999998